taylor-an/STM32_Web_Snmp/SYSTEM/usart/usart2.c
/*
//
	Project 	: mbus
	File Name 	: usart.c
	Author 		: songlaifeng wanghui
	Copyright		:	长沙光河信息科技有限公司版权所有
	Created on	: 2016-3-3
	Destribe	:
		
	modify :
		2016-9-26 串口架构修改成com方式
//
*/

//<<<<<<<<<<<<<<<<头文件<<<<<<<<<<<<<<<<
#include "stm32f10x.h"
#include "stm32f10x_usart.h"
#include "usart.h"
#include "stm32_eth.h"
#include "string.h"
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//<<<<<<<<<<<<<<<<宏定义<<<<<<<<<<<<<<<<

#define USART1_485_SEND()		
#define USART1_485_RECEIVE()		

#define USART2_485_SEND()
#define USART2_485_RECEIVE()

#define USART6_485_SEND()	
#define USART6_485_RECEIVE() 

#define USART3_485_GPIO		GPIOB
#define USART3_485_PIN		GPIO_Pin_12
#define USART3_485_RCC		RCC_AHB1Periph_GPIOB
#define USART3_485_SEND()		GPIO_SetBits(USART3_485_GPIO, USART3_485_PIN)
#define USART3_485_RECEIVE()		GPIO_ResetBits(USART3_485_GPIO, USART3_485_PIN)

#define USART5_485_SEND()
#define USART5_485_RECEIVE()
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//<<<<<<<<<<<<<<<<枚举定义<<<<<<<<<<<<<<<<
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//<<<<<<<<<<<<<<<<结构定义<<<<<<<<<<<<<<<<
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//<<<<<<<<<<<<<<<<变量申明<<<<<<<<<<<<<<<<
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//<<<<<<<<<<<<<<<<函数申明<<<<<<<<<<<<<<<<
static int usart1_init(Usart_uint32,EUSART_Parity);

static int usart2_init(Usart_uint32,EUSART_Parity);

static int usart3_init(Usart_uint32,EUSART_Parity);

static int usart4_init(Usart_uint32,EUSART_Parity);

static int usart5_init(Usart_uint32,EUSART_Parity);


static int usart1_send_str(void*,Usart_uint16);

static int usart2_send_str(void*,Usart_uint16);

static int usart3_send_str(void*,Usart_uint16);

static int usart4_send_str(void*,Usart_uint16);

static int usart5_send_str(void*,Usart_uint16);


static int usart1_send_pstr(void *p);

static int usart2_send_pstr(void *p);

static int usart3_send_pstr(void *p);

static int usart4_send_pstr(void *p);

static int usart5_send_pstr(void *p);

//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//<<<<<<<<<<<<<<<<变量定义<<<<<<<<<<<<<<<<
static PSTUsart g_usart1_irq, g_usart2_irq, g_usart3_irq, g_usart4_irq, g_usart5_irq;
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//<<<<<<<<<<<<<<<<函数定义<<<<<<<<<<<<<<<<

void mystrncpy(void * des, void * souce, u32 len)
{
	uint8 * pdes = (uint8 *)des;
	uint8 * psouce = (uint8 *)souce;
	u32 i = 0;
	
	for(i = 0; i < len; i++)
	{
		pdes[i] = psouce[i];
	}
}

//初始化串口
void com_init(PSTUsart com)
{
	if(com->name == EUsart_1)
	{
		g_usart1_irq = com;
		usart1_init(com->bound, com->partity);
	}
	else if(com->name == EUsart_2)
	{
		g_usart2_irq = com;
		usart2_init(com->bound, com->partity);
	}
	else if(com->name == EUsart_3)
	{
		g_usart3_irq = com;
		usart3_init(com->bound, com->partity);
	}
	else if(com->name == EUsart_4)
	{
		g_usart3_irq = com;
		usart4_init(com->bound, com->partity);
	}
	else if(com->name == EUsart_5)
	{
		g_usart5_irq = com;
		usart5_init(com->bound, com->partity);
	}	
}

//发送字符函数
void com_send_str(PSTUsart com,void* str,Usart_uint16 len)
{
	if(com->name == EUsart_1)
	{
		usart1_send_str(str,len);
	}
	else if(com->name == EUsart_2)
	{
		usart2_send_str(str,len);
	}
	else if(com->name == EUsart_3)
	{
		usart3_send_str(str,len);
	}
	else if(com->name == EUsart_4)
	{
		usart4_send_str(str, len);
	}
	else if(com->name == EUsart_5)
	{
		usart5_send_str(str,len);
	}	
}

//设定串口中断状态
void set_com_interrupt_state(PSTUsart com, EUsart_Interrupt_State usart_interrupt_state)
{
	(void)com;
	(void)usart_interrupt_state;
	if(com->name == EUsart_1)
	{
		(usart_interrupt_state == EUSART_Interrupt_State_On)\
		?( USART_ITConfig(USART1, USART_IT_RXNE, ENABLE) )\
		:( USART_ITConfig(USART1, USART_IT_RXNE, DISABLE));
	}
	else if(com->name == EUsart_2)
	{
		(usart_interrupt_state == EUSART_Interrupt_State_On)\
		?( USART_ITConfig(USART2, USART_IT_RXNE, ENABLE) )\
		:( USART_ITConfig(USART2, USART_IT_RXNE, DISABLE));
	}
	else if(com->name == EUsart_3)
	{
		(usart_interrupt_state == EUSART_Interrupt_State_On)\
		?( USART_ITConfig(USART3, USART_IT_RXNE, ENABLE) )\
		:( USART_ITConfig(USART3, USART_IT_RXNE, DISABLE));
	}	
	else if(com->name == EUsart_5)
	{
		(usart_interrupt_state == EUSART_Interrupt_State_On)\
		?( USART_ITConfig(UART5, USART_IT_RXNE, ENABLE) )\
		:( USART_ITConfig(UART5, USART_IT_RXNE, DISABLE));
	}		
}

//		串口数组数据处理函数
Usart_int8 receive_str_manage(PSTUsart com, void *store, Usart_uint8 count)
{
		static Usart_uint32 usart1_tmp = 0;
		static Usart_uint32 usart2_tmp = 0;
		static Usart_uint32 usart3_tmp = 0;
		static Usart_uint32 usart5_tmp = 0;
	  static Usart_uint32 usart4_tmp = 0;
	
		static Usart_uint8 usart1_state = 0;
		static Usart_uint8 usart2_state = 0;
		static Usart_uint8 usart3_state = 0;
		static Usart_uint8 usart5_state = 0;
	  static Usart_uint8 usart4_state = 0;

		unsigned char buff[USART_RECEIVE_MAX] = {0};
		unsigned int len = 0;
		Usart_int8 tmp = 0;
		
		if(com->name == EUsart_1)
		{
				if(com->receive_count != usart1_tmp)
				{	
					usart1_tmp = com->receive_count;
					usart1_state++;
					return tmp;
				}
				if(usart1_state > 0)
				{
					mystrncpy((char *)buff, (char *)com->buff, com->receive_count);
					len = com->receive_count;
				
					com->receive_count = 0;
					memset(com->buff, 0, USART_RECEIVE_MAX);
					usart1_tmp = 0;
					usart1_state = 0;
				
					tmp = com->func(buff, len, store, count);			
				}
		}
		else if(com->name == EUsart_2)
		{
			if(com->receive_count != usart2_tmp)
			{	
				usart2_tmp = com->receive_count;
				usart2_state++;
				return tmp;
			}
			if(usart2_state > 0)
			{
				mystrncpy((char *)buff, (char *)com->buff, com->receive_count);
				len = com->receive_count;
			
				com->receive_count = 0;
				memset(com->buff, 0, USART_RECEIVE_MAX);
				usart2_tmp = 0;
				usart2_state = 0;
			
				tmp = com->func(buff, len, store, count);			
			}
		}
		else if(com->name == EUsart_3)
		{
			if(com->receive_count != usart3_tmp)
			{	
				usart3_tmp = com->receive_count;
				usart3_state++;
				return tmp;
			}
			if(usart3_state > 0)
			{
				mystrncpy((char *)buff, (char *)com->buff, com->receive_count);
				len = com->receive_count;
			
				com->receive_count = 0;
				memset(com->buff, 0, USART_RECEIVE_MAX);
				usart3_tmp = 0;
				usart3_state = 0;
			
				tmp = com->func(buff, len, store, count);			
			}
		}
		else if(com->name == EUsart_5)
		{
			if(com->receive_count != usart5_tmp)
			{	
				usart5_tmp = com->receive_count;
				usart5_state++;
				return tmp;
			}
			if(usart5_state > 0)
			{
				mystrncpy((char *)buff, (char *)com->buff, com->receive_count);
				len = com->receive_count;
			
				com->receive_count = 0;
				memset(com->buff, 0, USART_RECEIVE_MAX);
				usart5_tmp = 0;
				usart5_state = 0;
			
				tmp = com->func(buff, len, store, count);			
			}
		}
		else if(com->name == EUsart_4)
		{
			if(com->receive_count != usart4_tmp)
			{	
				usart4_tmp = com->receive_count;
				usart4_state++;
				return tmp;
			}
			if(usart4_state > 0)
			{
				mystrncpy((char *)buff, (char *)com->buff, com->receive_count);
				len = com->receive_count;
			
				com->receive_count = 0;
				memset(com->buff, 0, USART_RECEIVE_MAX);
				usart4_tmp = 0;
				usart4_state = 0;
			
				tmp = com->func(buff, len, store, count);			
			}
		}
		return tmp;		
}

//清除缓存
void clear_com_buff(PSTUsart com)
{
		memset(com->buff, 0 , USART_RECEIVE_MAX);
		com->receive_count = 0;
}


//发送一个字符
void com_send_byte(PSTUsart com,Usart_uint8 byte)
{
	if(com->name == EUsart_1)
	{
		while(USART_GetFlagStatus(USART1, USART_FLAG_TC)==RESET); 
		USART_SendData(USART1 ,byte);//发送字符
		while(USART_GetFlagStatus(USART1, USART_FLAG_TC)==RESET); 
	}
	else if(com->name == EUsart_2)
	{
		while(USART_GetFlagStatus(USART2, USART_FLAG_TC)==RESET); 
		USART_SendData(USART2 ,byte);//发送字符
		while(USART_GetFlagStatus(USART2, USART_FLAG_TC)==RESET); 
	}
	else if(com->name == EUsart_3)
	{
		while(USART_GetFlagStatus(USART3, USART_FLAG_TC)==RESET); 
		USART_SendData(USART3 ,byte);//发送字符
		while(USART_GetFlagStatus(USART3, USART_FLAG_TC)==RESET); 
	}
	else if(com->name == EUsart_5)
	{
		while(USART_GetFlagStatus(UART5, USART_FLAG_TC)==RESET); 
		USART_SendData(UART5 ,byte);//发送字符
		while(USART_GetFlagStatus(UART5, USART_FLAG_TC)==RESET); 
	}		
}


void com_send_pstr(PSTUsart com,void *p)
{
	if(com->name == EUsart_1)
	{
		usart1_send_pstr(p);
	}
	else if(com->name == EUsart_2)
	{
		usart2_send_pstr(p);
	}
	else if(com->name == EUsart_3)
	{
		usart3_send_pstr(p);
	}
	else if(com->name == EUsart_4)
	{
		usart4_send_pstr(p);
	}
	else if(com->name == EUsart_5)
	{
		usart5_send_pstr(p);
	}
}
//----------------辅助函数 start----------------
//初始化串口1
static int usart1_init(Usart_uint32 bound,EUSART_Parity parity)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	
	(void)parity;
	
	//485使能初始化
	//
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1|RCC_APB2Periph_GPIOA|RCC_APB2Periph_AFIO, ENABLE);	
//	
	//USART1_TX   PA.9
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9; //PA.9
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;	//复用推挽输出
	GPIO_Init(GPIOA, &GPIO_InitStructure); //初始化PA9
   
