taylor-an/STM32_Web_Snmp/SYSTEM/usart/usart2.c
   //USART3 初始化设置
	 
	USART_InitStructure.USART_BaudRate = bound;//波特率设置
	
	if(parity != EUSART_Parity_No)
	{
		USART_InitStructure.USART_WordLength = USART_WordLength_9b;//字长为8位数据格式
	}
	else
	{
		USART_InitStructure.USART_WordLength = USART_WordLength_8b;//字长为8位数据格式
	}
	
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//一个停止位
	
	if(parity == EUSART_Parity_Even)
	{
		USART_InitStructure.USART_Parity = USART_Parity_Even;//偶校验位
	}
	else if(parity == EUSART_Parity_Odd)
	{
		USART_InitStructure.USART_Parity = USART_Parity_Odd;//奇校验位
	}
	else
	{
		USART_InitStructure.USART_Parity = USART_Parity_No;//无奇偶校验位
	}
	
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//无硬件数据流控制
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;	//收发模式
  USART_Init(UART4, &USART_InitStructure); //初始化串口3
	
	
	//USART_ClearFlag(USART1, USART_FLAG_TC);
	
	USART_ITConfig(UART4, USART_IT_RXNE, ENABLE);//开启相关中断
	
	 USART_Cmd(UART4, ENABLE);  //使能串口3

	 
  NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;//串口1中断通道
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;//抢占优先级3
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;		//子优先级3
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//IRQ通道使能
	NVIC_Init(&NVIC_InitStructure);	//根据指定的参数初始化VIC寄存器、
	
 
	return 0;
}


/**********************************************************************************************/
//初始化串口5
static int usart5_init(Usart_uint32 bound,EUSART_Parity parity)
{
	//GPIO端口设置
	GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	
	(void)parity;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC|RCC_APB2Periph_AFIO, ENABLE);	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);		
//  
  /* Configure USART1_Tx as alternate function push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;//USART1_TX
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
//  
  /* Configure USART1_Rx as input floating */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

   //USART3 初始化设置
	USART_InitStructure.USART_BaudRate = bound;//波特率设置
	
	if(parity != EUSART_Parity_No)
	{
		USART_InitStructure.USART_WordLength = USART_WordLength_9b;//字长为8位数据格式
	}
	else
	{
		USART_InitStructure.USART_WordLength = USART_WordLength_8b;//字长为8位数据格式
	}
	
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//一个停止位
	
	if(parity == EUSART_Parity_Even)
	{
		USART_InitStructure.USART_Parity = USART_Parity_Even;//偶校验位
	}
	else if(parity == EUSART_Parity_Odd)
	{
		USART_InitStructure.USART_Parity = USART_Parity_Odd;//奇校验位
	}
	else
	{
		USART_InitStructure.USART_Parity = USART_Parity_No;//无奇偶校验位
	}
	
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//无硬件数据流控制
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;	//收发模式
  USART_Init(UART5, &USART_InitStructure); //初始化串口5
	
  USART_Cmd(UART5, ENABLE);  //使能串口5
	
	//USART_ClearFlag(USART1, USART_FLAG_TC);
	
	USART_ITConfig(UART5, USART_IT_RXNE, ENABLE);//开启相关中断

	//Usart3 NVIC 配置
	NVIC_InitStructure.NVIC_IRQChannel = UART5_IRQn;//串口6中断通道
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;//抢占优先级3
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;		//子优先级3
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//IRQ通道使能
	NVIC_Init(&NVIC_InitStructure);	//根据指定的参数初始化VIC寄存器、
	
	USART5_485_RECEIVE();
	
	return 0;
}
/**************************************************************************************************************/
//串口1发送函数
static int usart1_send_str(void* str,Usart_uint16 len)
{
	Usart_uint16 i;
	Usart_int8 * s;
	
	USART1_485_SEND();
	
	s = (Usart_int8 *)str;
	
	for(i = 0; i< len; i++)
	{
			while(USART_GetFlagStatus(USART1, USART_FLAG_TC)==RESET); 
			USART_SendData(USART1 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(USART1, USART_FLAG_TC)==RESET){}
	
	USART1_485_RECEIVE();
	
	return 0;
}

//串口2发送函数
static int usart2_send_str(void* str,Usart_uint16 len)
{
	Usart_uint16 i;
	Usart_int8 * s;
	
	
	s = (Usart_int8 *)str;
	
	for(i = 0; i< len; i++)
	{
			while(USART_GetFlagStatus(USART2, USART_FLAG_TC)==RESET); 
			USART_SendData(USART2 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(USART2, USART_FLAG_TC)==RESET); 
	
	return 0;
}

//串口3发送函数
static int usart3_send_str(void* str,Usart_uint16 len)
{
	Usart_uint16 i;
	Usart_int8 * s;
	
	USART3_485_SEND();
	
	s = (Usart_int8 *)str;
	
	for(i = 0; i< len; i++)
	{
			while(USART_GetFlagStatus(USART3, USART_FLAG_TC)==RESET); 
			USART_SendData(USART3 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(USART3, USART_FLAG_TC)==RESET){}
	
	USART3_485_RECEIVE();
	
	return 0;
}

static int usart4_send_str(void* str,Usart_uint16 len)
{
	Usart_uint16 i;
	Usart_int8 * s;
		
	s = (Usart_int8 *)str;
	
	for(i = 0; i< len; i++)
	{
			while(USART_GetFlagStatus(UART4, USART_FLAG_TC)==RESET); 
			USART_SendData(UART4 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(UART4, USART_FLAG_TC)==RESET){}
	
 
	
	return 0;
}

//串口5发送函数
static int usart5_send_str(void* str,Usart_uint16 len)
{
	Usart_uint16 i;
	Usart_int8 * s;
	
	USART5_485_SEND();
	
	s = (Usart_int8 *)str;
	
	for(i = 0; i< len; i++)
	{
			while(USART_GetFlagStatus(UART5, USART_FLAG_TC)==RESET); 
			USART_SendData(UART5 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(UART5, USART_FLAG_TC)==RESET){} 
	
	USART5_485_RECEIVE();
	
	return 0;
}


//串口1发送函数
static int usart1_send_pstr(void* str)
{
	Usart_int8 * s;
	
	USART1_485_SEND();
	
	s = (Usart_int8 *)str;
	
	while(*s)
	{
			while(USART_GetFlagStatus(USART1, USART_FLAG_TC)==RESET); 
			USART_SendData(USART1 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(USART1, USART_FLAG_TC)==RESET){}
	
	USART1_485_RECEIVE();
	
	return 0;
}

//串口2发送函数
static int usart2_send_pstr(void* str)
{
	Usart_int8 * s;	
	
	s = (Usart_int8 *)str;
	
	USART2_485_SEND();
	
