taylor-an/STM32_Web_Snmp/SYSTEM/usart/usart2.c
	while(*s)
	{
			while(USART_GetFlagStatus(USART2, USART_FLAG_TC)==RESET); 
			USART_SendData(USART2 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(USART2, USART_FLAG_TC)==RESET){} 
	
	USART2_485_RECEIVE();
	
	return 0;
}

//串口3发送函数
static int usart3_send_pstr(void* str)
{
	Usart_int8 * s;
	
	USART3_485_SEND();
	
	s = (Usart_int8 *)str;
	
	while(*s)
	{
			while(USART_GetFlagStatus(USART3, USART_FLAG_TC)==RESET); 
			USART_SendData(USART3 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(USART3, USART_FLAG_TC)==RESET){}
	
	USART3_485_RECEIVE();
	
	return 0;
}

//串口4发送函数
static int usart4_send_pstr(void* str)
{
	Usart_int8 * s;
	
 
	
	s = (Usart_int8 *)str;
	
	while(*s)
	{
			while(USART_GetFlagStatus(UART4, USART_FLAG_TC)==RESET); 
			USART_SendData(UART4 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(UART4, USART_FLAG_TC)==RESET){}
	
 
	
	return 0;
}

//串口5发送函数
static int usart5_send_pstr(void* str)
{
	Usart_int8 * s;
	
	USART5_485_SEND();
	
	s = (Usart_int8 *)str;
	
	while(*s)
	{
			while(USART_GetFlagStatus(UART5, USART_FLAG_TC)==RESET); 
			USART_SendData(UART5 ,*s++);//发送当前字符
	}
	
	while(USART_GetFlagStatus(UART5, USART_FLAG_TC)==RESET){}
	
	USART5_485_RECEIVE();
	
	return 0;
}



//----------------辅助函数 end----------------

//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//>>>>>>>>>>>>>>>>>中段服务程序>>>>>>>>>>>>>>>>>>
void USART1_IRQHandler(void)                	//串口1中断服务程序
{
		Usart_uint8 Res=0;	
			
		if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)
		{	
				Res = USART_ReceiveData(USART1);
			
				(g_usart1_irq->buff)[g_usart1_irq->receive_count] = Res;  	  //将接收到的字符串存到缓存中

				(g_usart1_irq->receive_count)++;

				if((g_usart1_irq->receive_count) >= USART_RECEIVE_MAX)       		//如果缓存满,将缓存指针指向缓存的首地址
				{
					(g_usart1_irq->receive_count) = 0;
				} 
		}
		
} 

void USART2_IRQHandler(void)                	//串口2中断服务程序
{
		Usart_uint8 Res=0;
		
		if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)
		{
			Res = USART_ReceiveData(USART2);
		
			(g_usart2_irq->buff)[g_usart2_irq->receive_count] = Res;  	  //将接收到的字符串存到缓存中

			(g_usart2_irq->receive_count)++;

			if((g_usart2_irq->receive_count) >= USART_RECEIVE_MAX)       		//如果缓存满,将缓存指针指向缓存的首地址
			{
				(g_usart2_irq->receive_count) = 0;
			}		
		}
} 

void USART3_IRQHandler(void)                	//串口3中断服务程序
{
		Usart_uint8 Res=0;
		if(USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)
		{
			Res = USART_ReceiveData(USART3);
		
			(g_usart3_irq->buff)[g_usart3_irq->receive_count] = Res;  	  //将接收到的字符串存到缓存中

			(g_usart3_irq->receive_count)++;

			if((g_usart3_irq->receive_count) >= USART_RECEIVE_MAX)       		//如果缓存满,将缓存指针指向缓存的首地址
			{
				(g_usart3_irq->receive_count) = 0;
			}	
		}
} 

void UART4_IRQHandler(void)                	//串口4中断服务程序
{
		Usart_uint8 Res=0;
		if(USART_GetITStatus(UART4, USART_IT_RXNE) != RESET)
		{
			Res = USART_ReceiveData(UART4);
		
			(g_usart4_irq->buff)[g_usart4_irq->receive_count] = Res;  	  //将接收到的字符串存到缓存中

			(g_usart4_irq->receive_count)++;

			if((g_usart4_irq->receive_count) >= USART_RECEIVE_MAX)       		//如果缓存满,将缓存指针指向缓存的首地址
			{
				(g_usart4_irq->receive_count) = 0;
			}	
		}
} 

void UART5_IRQHandler(void)                	//串口5中断服务程序
{
		Usart_uint8 Res=0;
		
		if(USART_GetITStatus(UART5, USART_IT_RXNE) != RESET)
		{
			Res = USART_ReceiveData(UART5);

			(g_usart5_irq->buff)[g_usart5_irq->receive_count] = Res;  	  //将接收到的字符串存到缓存中

			(g_usart5_irq->receive_count)++;

			if((g_usart5_irq->receive_count) >= USART_RECEIVE_MAX)       		//如果缓存满,将缓存指针指向缓存的首地址
			{
				g_usart5_irq->receive_count = 0;
			}	
		}
} 

//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

//
//...文件其他内容...
//
